app/views/houses/show.html.erb

<h1><%= @houses.name %></h1>
<% @houses.students.each do |student| %>
---
SELECT "students".* FROM "students" WHERE "students"."house_id" = $1  [["house_id", 1]]